# Brewfile, basics
# The Xcode Command Line Tools are a prerequisite; not installed here.

# shell + cli
brew "coreutils"      # GNU coreutils (PATH adds its gnubin)
brew "tree"
brew "fd"             # fast find (the fd function)
brew "gh"             # GitHub CLI
brew "httpie"
brew "glow"           # markdown in the terminal
brew "mas"            # Mac App Store CLI
brew "duti"           # default-app associations
brew "shellcheck"      # lint POSIX sh: bootstrap, test

# runtimes
brew "fnm"            # node version manager
brew "uv"             # python

# data services
brew "redis"
brew "postgresql@18"

# cloud + media
brew "awscli"
brew "ffmpeg"
brew "cloudflared"   # tunnels (the tunnel function)
brew "heroku"        # heroku CLI
brew "kubernetes-cli" # kubectl
brew "shpotify"      # spotify CLI (the spotify function)

# ai clis
cask "codex"          # OpenAI Codex CLI
cask "claude-code"    # Claude Code CLI

# apps
cask "zed"            # editor (EDITOR + default for code files)
cask "claude"         # Claude desktop
cask "chatgpt"        # ChatGPT desktop
cask "google-chrome"
cask "docker-desktop"
cask "slack"
cask "spotify"
